classes/druid.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-20 Sun 17:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Druid</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/stylesheets/subclass-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Druid</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbe9fb23">1. Proficiencies</a></li>
<li><a href="#orgd2367bf">2. Level-up</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[<a href="../dnd.html#ID-7d419730-2064-41f9-80ee-f24ed9b01ac7">Main Menu</a>] [<a href="classes.html#ID-69ef1740-156a-4e42-9493-49ec80a4ac26">Classes</a>]
</p>
</div>
<hr />
<p>
Whether calling on the forces of nature, or emulating the creatures of the world, Druids are the embodiment of nature&rsquo;s resilience, bounty, and fury. They claim no mastery over nature, but see themselves as willing partners and extensions of nature&rsquo;s indomitable will.
</p>

<p>
To start as a Druid, choose a domain of nature to integrate with: [Plant, Animal, Stone, Cosmos]. Each domain offers the wielder a few distinct advantages right away. All Druids can learn druid cantrips and druids can learn druid spells through their Druid Circle.
</p>

<ul class="org-ul">
<li><span class="underline">Initial Health</span>: Roll a 1d8 and add it to your base HP. This is your Hit Die (HD). You will add the amount your rol lto your base health every time your level up.</li>
<li>Spells are cast using WIS + PROF (Wisdom modifier + Proficiency modifier)</li>
</ul>

<p>
Learn <b>Druidic</b>: A secret language of Druids that allow them to speak in secret to other Druids, and hear whispers from nature around them.
</p>
<div id="outline-container-orgbe9fb23" class="outline-2">
<h2 id="orgbe9fb23"><span class="section-number-2">1.</span> Proficiencies</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Armor</th>
<th scope="col" class="org-left">Weapons</th>
<th scope="col" class="org-left">Tools</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Light armor</td>
<td class="org-left">Clubs</td>
<td class="org-left">Herbalism Kit</td>
</tr>

<tr>
<td class="org-left">Medium armor</td>
<td class="org-left">Daggers</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Shields</td>
<td class="org-left">Quarterstaff</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Sickle</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Scimitar</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Spear</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd2367bf" class="outline-2">
<h2 id="orgd2367bf"><span class="section-number-2">2.</span> Level-up</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Learn Druid Alchemy and unlock latent abilities. Learn 1 <a href="../guides/spell-index.html#ID-b32b2d16-0b71-4af9-9464-b5575f720a99">Druid Cantrip</a> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></li>
<li><p>
Add 1d6 to your max HP. Enter a Druid Circle. Groups of druids pool their powers together to unlock a deeper connection with nature and themselves. This allows Druids to tap into the combined power of their circle to unlock new powers and abilities. Join one of the following:
</p>
<ul class="org-ul">
<li><a href="../guides/druid-circles.html#ID-92febd59-6eaa-4865-9d56-d774d2cc6242">Circle of Wildfire</a></li>
<li><a href="../guides/druid-circles.html#ID-3a7918b4-f554-49e8-a776-b61a2367c45e">Circle of Tempest</a></li>
<li><a href="../guides/druid-circles.html#ID-d4220018-171b-4cbe-8402-4400d683be28">Circle of Spores</a></li>
<li><a href="../guides/druid-circles.html#ID-0fac5d1e-c2d6-47d5-8062-3bc4887a03c6">Circle of Stars</a></li>
</ul>

<p>
You start with 3 level 1 spell slots (Total: 3, 0, 0, 0).
</p></li>
<li>Become able to use cantrips outside of combat. The player will still be constrained by the limits of the cantrip, the context of the constraints may subject to change however . Consult your DM.</li>
<li>Learn 1 Druid cantrip and one Druid spell through your circle. Add 1d6 to your max HP.</li>
<li>You can now learn level two spells. Add +1 WIS and +1 of ANY, as well as one level two spell slot (Total: 3, 1, 0, 0).</li>
<li>Add one level one spell slot (Total: 4, 1, 0, 0) and add 1d6 health</li>
<li>Learn 1 Druid cantrip, 1 Druid spell, and 1d6 health</li>
<li>Upgrade a Druid cantrip. Consult with the DM about which cantrip you&rsquo;d like to upgrade to determine what the new effects of the cantrip will be.</li>
<li>Add one level two spell slot (Total: 4, 2, 0, 0)</li>
<li>Walk between the boundaries of nature. Choose another Druid Cicle to join and draw power from. Add 1d6 health.</li>
<li>You are now able to learn level three spells. Add one level 3 spell slot, one Druid spell and one cantrip (Total: 4, 2, 1, 0).</li>
<li>Add +1 WIS and +1 CHA. Add 1d6 to your health.</li>
<li>Add +1 to ANY. Add 1d6 health</li>
<li>Add +1 to ANY. Add 1d6 health</li>
<li>You are now able to learn level 4 spells. Add one level four spell slot (Total 4, 2, 1, 1). Add 1d6 health</li>
<li>Learn 1 Druid spell and 1 cantrip.</li>
<li>Add +1 to ANY. Add 1d6 health.</li>
<li>Add 1 level 3 spell slot (Total 4, 2, 2, 1). Learn 2 Druid spells as well as 1 cantrip.</li>
<li>Become an Archdruid. You can use wild shape an unlimited amount of times for a indefinite period of time. You can ignore the verbal and somatic components of Druid spells. Add 1d6 health.</li>
<li><p>
Multiclass
</p>
<hr /></li>
</ol>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Glossary: <a href="../glossary.html#ID-a3719559-2b06-443a-b75a-96c9aa3f3b26">cantrip</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-12 Wed 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-08-20 Sun 17:23</p>
</div>
</body>
</html>